Freimor/HRDW-ESPDeka_v0.1/firmware/lora_coprocessor/sdkconfig.defaults
# -----------------------------------------------------------------------------
# ESPDeka LORA coprocessor (ESP32-C3 on P-3 V1.6 / ExpressLRS LR1121 module)
# -----------------------------------------------------------------------------

CONFIG_IDF_TARGET="esp32c3"

# ESP32-C3 supports 160 MHz max; avoid the 240 MHz misconfiguration seen on ELRS.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_FREERTOS_HZ=1000

# Host UART to ESP32-P4 (or USB-UART bench cable on the left RX/TX pads).
CONFIG_ESPDEKA_HOST_UART_PORT_0=y
